# 项目名
program = "AutoUpdateJdCookie"
# 网页title
unique_title = "京东登录注册"
# 支持的形状类型
supported_types = [
    "三角形",
    "正方形",
    "长方形",
    "五角星",
    "六边形",
    "圆形",
    "梯形",
    "圆环"
]
# 定义了支持的每种颜色的 HSV 范围
supported_colors = {
    '紫色': ([125, 50, 50], [145, 255, 255]),
    '灰色': ([0, 0, 50], [180, 50, 255]),
    '粉色': ([160, 50, 50], [180, 255, 255]),
    '蓝色': ([100, 50, 50], [130, 255, 255]),
    '绿色': ([40, 50, 50], [80, 255, 255]),
    '橙色': ([10, 50, 50], [25, 255, 255]),
    '黄色': ([25, 50, 50], [35, 255, 255]),
    '红色': ([0, 50, 50], [10, 255, 255])
}